Revit 2018 API
FilterIntegerRule Members
The FilterIntegerRule type exposes the following members.
Constructors
Name | Description
FilterIntegerRule
 Constructs an instance of FilterIntegerRule.
Methods
Name | Description
Dispose |  (Inherited from FilterRule.)
ElementPasses
 Derived classes override this method to implement the test that determines whether the given element passes this rule or not.
 (Inherited from FilterRule.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetEvaluator
 Gets the evaluator that implements the test for this rule.
 (Inherited from FilterNumericValueRule.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetEvaluator
 Sets the evaluator that implements the test for this rule.
 (Inherited from FilterNumericValueRule.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from FilterRule.)
RuleValue
 The user-supplied value against which values from a Revit document will be tested.
See Also
FilterIntegerRule Class
Autodesk.Revit.DB Namespace